<?php
//显示位置参数
$arrMType = array();
//生成JS的分类
$arrMType[1] = '全站顶部450*100图片';
$arrMType[2] = '首页第一个长条Logo960*79图片,添加此处的广告图片需要特殊说明';
$arrMType[3] = '首页第二个长条Logo960*79图片,添加此处的广告图片需要特殊说明';
$arrMType[4] = '首页幻灯片广告,图片的尺寸必须为900*310';
$arrMType[5] = '公司logo广告(154*55),尺寸必须填写';
$arrMType[6] = '左侧浮动广告位(140*350)';
$arrMType[7] = '右侧浮动广告位(140*350)';
//$arrMType[8] = '右侧4#广告位(235*60)';
//$arrMType[9] = '右侧5#广告位(235*60)';


//$arrMType[20] = '供求信息右侧图片广告位235*60';
//$arrMType[30] = '网上商展右侧图片广告位235*60';
//$arrMType[40] = '会展信息右侧图片广告位235*60';
//$arrMType[50] = '人才招聘右侧图片广告位235*60';
//$arrMType[60] = '行业资讯右侧图片广告位235*60';
//$arrMType[70] = '行业视频右侧图片广告位235*60';
//$arrMType[80] = '企业黄页右侧图片广告位235*60';

?>