<div class="agreement">
<h5>BIWEB WMS 软件使用协议</h5> <br />
<br />
在开始安装和使用BIWEB之前，请务必仔细阅读本授权文档，在确定您理解和同意以下全部条款后， 方可继续安装和使用。
上海网务网络信息有限公司为BIWEB产品的开发商，依法独立拥有BIWEB产品著作权。上海网务网络信息有限公司网址为<a href="http://www.bizeway.com" target="_blank" class="linkA">http://www.bizeway.com</a>。	 <br />
<br />
BIWEB著作权已在中华人民共和国国家版权局注册，著作权受到法律和国际公约保护。使用者无论个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，在理解、同意、并遵守本协议的全部条款后，方可开始使用BIWEB软件。<br />
<br />
本授权协议适用且仅适用于不同版本的BIWEB产品，上海网务网络信息有限公司拥有对本授权协议的最终解释权。<br />
<br />
I. 协议许可的权利<br />
1. 您可以在完全遵守本最终用户授权协议的基础上应用本软件，而不必支付软件版权授权费用。<br />
2. 您可以在本协议规定的约束和限制范围内修改BIWEB源代码（如果被提供的话）或界面风格以适应您的网站要求。
3. 您可以在协议规定的约束和限制范围内为BIWEB提供相关的插件，插件版权归作者所有。您可以将拥有版权的插件无偿提供给上海网务网络信息有限公司，但没有一定被采纳的承诺或保证。如若在新版本里采用了您开发的插件，插件源代码部分将标注作者的名字。<br />
4. 您若需要本协议授权外的技术支持，可以和上海网务网络信息有限公司签订有偿技术支持的协议，并且享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。 自协议签订时刻起，您可以在技术支持期限内拥有通过指定的方式获得指定范围内的技术支持服务。<br />
5. 您若是没有和上海网务网络信息有限公司签订有偿技术支持协议的授权用户，您也同样享有反映和提出意见的权力，但没有一定被采纳的承诺或保证。<br />
<br />
II. 协议规定的约束和限制<br />
1. 不得对本软件或与之关联的授权进行出租、出售、抵押或发放子许可证。<br />
2. 无论如何，即无论用途如何、是否经过修改或美化、修改程度如何，只要使用BIWEB的整体或任何部分，未经书面许可，系统页面页脚处的BIWEB名称和上海网务网络信息有限公司下属网站（<a href="http://www.biweb.cn" target="_blank" class="linkA">http://www.biweb.cn</a>） 的链接都必须保留，而不能清除或修改。<br />
3. 禁止在BIWEB的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。<br />
4. 如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。<br />
<br />
III. 有限担保和免责声明<br />
1. 本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。<br />
2. 用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。<br />
3. 上海网务网络信息有限公司不对使用本软件构建的系统中的文章或信息承担任何责任。<br />
有关BIWEB最终用户授权协议、授权与技术服务的详细内容，均由BIWEB官方网站独家提供。上海网务网络信息有限公司拥有在不事先通知的情况下，修改授权协议和技术服务价目表的权力，修改后的协议或价目表对自改变之日起的新授权用户生效。<br />
电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装BIWEB，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。
</div>
<div class="c"></div>
<div id="content">

<div class="wrapD">
<div class="wrapE">
<div class="c"></div>
</div>
</div>
<div class="stepbt">
<strong class="last">请务必认真阅读软件安装协议</strong>
<input style="cursor:pointer;" class="next biweb large" type="button" onclick="location.href='?step=2'" value="同意协议，进入下一步">
</div>

</div>

</div>